NextFOAM-2509/tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/cabin/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 100000;
    }

    outlet
    {
        type            calculated;
        value           uniform 100000;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            calculated;
        value           uniform 100000;
    }

    cabin_to_windshield
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
