NextFOAM-2509/tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.10      0    0)  // 0 // cabin interior
    ( -0.05      0    0)  // 1
    (  0.20      0    0)  // 2
    (  0.20   0.05    0)  // 3
    ( -0.05   0.05    0)  // 4
    ( -0.05   0.10    0)  // 5
    (  1.00   0.10    0)  // 6
    (  1.00   0.50    0)  // 7
    (  0.35   0.50    0)  // 8
    (  0.30   0.50    0)  // 9
    ( -0.10   0.10    0)  // 10
    ( -0.10   0.05    0)  // 11

    ( -0.1005  0.10    0)  // 12   // windshield (doubled vertices with 10, 9)
    (  0.2995  0.50    0)  // 13

    ( -0.50   0.50    0)  // 14   // cabin exterior
    ( -0.50   0.10    0)  // 15


    (     0      0    0.70)  // 16   // cabin interior
    (  0.05      0    0.70)  // 17
    (  0.20      0    0.70)  // 18
    (  0.20   0.05    0.70)  // 19
    (  0.05   0.05    0.70)  // 20
    (  0.05   0.10    0.70)  // 21
    (  1.00   0.10    0.70)  // 22
    (  1.00   0.50    0.70)  // 23
    (  0.45   0.50    0.70)  // 24
    (  0.40   0.50    0.70)  // 25
    (     0   0.10    0.70)  // 26
    (     0   0.05    0.70)  // 27

    (  -0.0005 0.10    0.70)  // 28   // windshield (doubled vertices with 26,25)
    (  0.3995  0.50    0.70)  // 29

    ( -0.50   0.50    0.70)  // 30  // cabin exterior
    ( -0.50   0.10    0.70)  // 31
);

blocks
(
    hex ( 1 2 3  4 17 18 19 20) cabin (15  5 50) simpleGrading (1 1 1)
    hex ( 0 1 4 11 16 17 20 27) cabin ( 7  5 50) simpleGrading (1 1 1)
    hex (11 4 5 10 27 20 21 26) cabin ( 7  5 50) simpleGrading (1 1 1)
    hex (10 5 8  9 26 21 24 25) cabin ( 7 45 50) simpleGrading (1 1 1)
    hex ( 5 6 7  8 21 22 23 24) cabin (45 45 50) simpleGrading (3 1 1)
    hex ( 12 10 9 13 28 26 25 29) windshield (45 45 50) simpleGrading (1 1 1)
);

edges
(
    arc 9 10 (0.07 0.3 0)
    arc 12 13 (0.0695 0.3 0)

    arc 25 26 (0.17 0.3 0.70)
    arc 28 29 (0.1695 0.3 0.70)

    arc 9 25 (0.33 0.5 0.35)
    arc 13 29 (0.3295 0.5 0.35)

    arc 10 26 (-0.07 0.1 0.35)
    arc 12 28 (-0.0705 0.1 0.35)

    arc 5 8 (0.13 0.3 0)
    arc 21 24 (0.23 0.3 0.70)

    arc 8 24 (0.38 0.5 0.35)
    arc 5 21 (-0.02 0.1 0.35)

    arc 11 27 (-0.07 0.05 0.35)
    arc 0 16 (-0.07 0 0.35)

    arc 4 20 (-0.02 0.05 0.35)
    arc 1 17 (-0.02 0 0.35)
);

defaultPatch
{
    name    walls;
    type    wall;
}

boundary
(
    inlet
    {
        type    patch;
        faces
        (
            (2 18 19 3)
        );
    }
    outlet
    {
        type    patch;
        faces
        (
            (6 22 23 7)
        );
    }
    exterior
    {
        type    patch;
        faces
        (
            (12 13 29 28)
        );
    }
    symmetry
    {
        type    symmetryPlane;
        faces
        (
            (5 6 7 8)
            (10 5 8 9)
            (12 10 9 13)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
